<?php
/*
Разработайте механизм корзины интернет-магазина. Реализуйте класс продукта (Product) со свойствами title (string), price (float) и components (массив объектов Product), и соответствующие методы для взаимодействия со свойствами. Свойство components служит для реализации товара-наборов (например, комплект клавиатура+мышь) и в случае, если экземпляр содержит компоненты, стоимость этого комплекта должна быть равна сумме стоимостей её компонентов. Разработайте класс корзины (Cart) с методами для добавления, удаления товаров, а также с методом вычисления полной стоимости корзины, с учётом того, что некоторые товары могут представлять из себя комплекты других товаров.
*/
